# Many to Many relationships in SQL

- Sometimes we need to model a relationship that is many-to-many 
- We need to add a "connection" table with two foreign keys
- There is usually no separate primary key

Course title (many) <----------------------------> (many) User / name / email 

Course (one)                                    (many) Member (many)                                    (one) User
- id              <-------------------------   - user_id               ------------------------->      - id
- title                                        - course_id                                             - name
                                                                                                       - email

We don't need to put an ID for the member table because we can make a composite key, which is, both foreign keys are the primary key for the table. Sometimes we can add additional data to the connection table to add context. For example, one might add a role column to define if the user is a student or an instructor.

# Start with a Fresh Database

CREATE TABLE User (
    id    INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT UNIQUE,
    name    TEXT,
    email    TEXT
)

CREATE TABLE Course (
    id    INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT UNIQUE,
    title TEXT
)

CREATE TABLE Member (
    user_id    INTEGER,
    course_id    INTEGER,
    role    INTEGER,
    PRIMARY KEY (user_id, course_id)
)

# Insert Users and Courses

INSERT INTO User (name, email) VALUES ('Jane', 'jane@tsugi.org');
INSERT INTO User (name, email) VALUES ('Ed', 'ed@tsugi.org');
INSERT INTO User (name, email) VALUES ('Sue', 'sue@tsugi.org');

INSERT INTO Course (title) VALUES ('Python');
INSERT INTO Course (title) VALUES ('SQL');
INSERT INTO Course (title) VALUES ('PHP');

# Insert Memberships

# For role, 1 is an instructor and 0 is a student

INSERT INTO Member (user_id, course_id, role) VALUES (1, 1, 1);
INSERT INTO Member (user_id, course_id, role) VALUES (2, 1, 0);
INSERT INTO Member (user_id, course_id, role) VALUES (3, 1, 0);

INSERT INTO Member (user_id, course_id, role) VALUES (1, 2, 0);
INSERT INTO Member (user_id, course_id, role) VALUES (2, 2, 1);

INSERT INTO Member (user_id, course_id, role) VALUES (2, 3, 1);
INSERT INTO Member (user_id, course_id, role) VALUES (3, 3, 0);

# Get some data out of those databases

SELECT
    User.name,
    Member.role,
    Course.title
FROM
    User JOIN Member JOIN Course
ON
    Member.user_id = User.id AND Member.course_id = Course.id
ORDER BY
    Course.title, Member.role DESC, User.name